//今天看书，又回顾了基本的信息表示。还是国外教材好读，想读英文原版。
//看了CSAPP第三章，明天练习一下各种指令，尤其是课后题
//赶紧看完本章到216页。中午之前。
//学使用obsidian
//在obsidian上面建bomb lab
//在obsidian上面建道学知识库
//把Pery的教训一字不落地总结下来，不要偏离。
//目前学了布尔代数里的谓词。在康德哲学里有眼熟。把形式逻辑转换为数学语言，我喜欢，很干净。Obsidian双向链接实在好用！原子化概念笔记很好使，贴合思维习惯，几乎是思维的可视化！爽！
//今天扒下来了7710和6260的网课字幕，明天开始做成知识库，作为技术文档作品
//今天了解了脑科学，确立了基本学习工作习惯，不要畏难，要享受构建壁垒的摩擦力；明确了逻辑构建的核心重要性，哪怕是自然语言；理解了input, state, output作为系统构建的核心，了解了状态机的概念、边界条件的必要性、压制逻辑的应该存在与实际存在，以及设计函数作为业务能力的意识；明天继续深化Obsidian网络，原子化概念，记录bug解决过程，记得继续建设复习功能；必要时找一段代码来debug并写文档；找一个可以自己造的轮子；找经典源码
//0
// Created by Madeleine on 2026/4/21.
//
